let arrA = [1, 2, 3]
let arrB = [...arrA, 4, 5, 6] // 전개 연산자 '...'
//--------------------------------------------
let objA = {
    a: 1,
    b: 2
};
let objB = {
    ...objA,
    c: 3,
    d: 4
};                          // 객체에도 사용 가능
//----------------------------------------------
function func(a, b, c) {
    console.log(a, b, c);
}
let arr = [1, 2, 3];
func(...arr);          // 함수의 매개변수로 활용
//-----------------------------------------------
function func2(...rest) {
    console.log(rest);
}
func2(1, 2, 3, 4);      // rest 매개변수로 개별요소를 배열로 묶음